cf_billing/InformationRegisters/энргСоставляющиеТарифныхЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСоставляющиеТарифныхЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СоставляющаяТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСоставляющиеТарифныхЗон/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает составляющие тарифных зон.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ПолучитьСоставляющиеТарифныхЗон() Экспорт
	
	СоставляющиеТарифныхЗон = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СоставляющиеТарифныхЗонТекстЗапроса(); 
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТарифнаяЗона = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТарифнаяЗона.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаТарифнаяЗона.Выбрать();
		
		мТЗ = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			мТЗ.Добавить(ВыборкаДетальныеЗаписи.СоставляющаяТарифнаяЗона);
		КонецЦикла;
		
		СоставляющиеТарифныхЗон.Вставить(ВыборкаТарифнаяЗона.ТарифнаяЗона, мТЗ);
		
	КонецЦикла;
		
	Возврат СоставляющиеТарифныхЗон;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоставляющиеТарифныхЗонТекстЗапроса()
	
	Возврат "ВЫБРАТЬ
	        |	энргСоставляющиеТарифныхЗон.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	энргСоставляющиеТарифныхЗон.СоставляющаяТарифнаяЗона КАК СоставляющаяТарифнаяЗона
	        |ИЗ
	        |	РегистрСведений.энргСоставляющиеТарифныхЗон КАК энргСоставляющиеТарифныхЗон
	        |ИТОГИ ПО
	        |	ТарифнаяЗона";
	
КонецФункции

#КонецОбласти

#КонецЕсли
